## Train Dataset

### Importing dataset

In [1]:
import pandas as pd

In [82]:
df = pd.read_csv("D:\\DATA_science\\DATA_science assignment\\Naive Bayes\\SalaryData_Train.csv")

In [83]:
df.head()

,age,workclass,education,educationno,maritalstatus,occupation,relationship,race,sex,capitalgain,capitalloss,hoursperweek,native,Salary
0,39,State-gov,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [84]:
df.isnull().sum()

age              0
workclass        0
education        0
educationno      0
maritalstatus    0
occupation       0
relationship     0
race             0
sex              0
capitalgain      0
capitalloss      0
hoursperweek     0
native           0
Salary           0
dtype: int64

In [85]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30161 entries, 0 to 30160
Data columns (total 14 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   age            30161 non-null  int64
 1   workclass      30161 non-null  object
 2   education      30161 non-null  object
 3   educationno    30161 non-null  int64
 4   maritalstatus  30161 non-null  object
 5   occupation     30161 non-null  object
 6   relationship   30161 non-null  object
 7   race           30161 non-null  object
 8   sex            30161 non-null  object
 9   capitalgain    30161 non-null  int64
 10  capitalloss    30161 non-null  int64
 11  hoursperweek   30161 non-null  int64
 12  native         30161 non-null  object
 13  Salary         30161 non-null  object
dtypes: int64(5), object(9)
memory usage: 3.2+ MB

In [86]:
df.describe()

                age   educationno   capitalgain   capitalloss  hoursperweek
count  30161.000000  30161.000000  30161.000000  30161.000000  30161.000000
mean      38.438115     10.121316   1092.044064     88.302311     40.931269
std       13.134830      2.550037   7406.466611    404.121321     11.980182
min       17.000000      1.000000      0.000000      0.000000      1.000000
25%       28.000000      9.000000      0.000000      0.000000     40.000000
50%       37.000000     10.000000      0.000000      0.000000     40.000000
75%       47.000000     13.000000      0.000000      0.000000     45.000000
max       90.000000     16.000000  99999.000000   4356.000000     99.000000

#### Dropping duplicate rows

In [87]:
df1 = df.drop_duplicates()

In [88]:
df1.shape

(26903, 14)

### Label Encoding

In [89]:
from sklearn.preprocessing import LabelEncoder
labelencoder = LabelEncoder()
df1.iloc[:, -1] = labelencoder.fit_transform(df1.iloc[:,-1])
df1.head(3)

C:\Users\LENOVO\anaconda3\lib\site-packages\pandas\core\indexing.py:1745: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  isetter(ilocs[0], value)

,age,workclass,education,educationno,maritalstatus,occupation,relationship,race,sex,capitalgain,capitalloss,hoursperweek,native,Salary
0,39,State-gov,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,0
1,50,Self-emp-not-inc,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,0
2,38,Private,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,0

In [90]:
y = df1['Salary']

In [91]:
df2 = pd.get_dummies(df1)

In [92]:
df2.head(2)

,age,educationno,capitalgain,capitalloss,hoursperweek,Salary,workclass_ Federal-gov,workclass_ Local-gov,workclass_ Private,workclass_ Self-emp-inc,...,native_ Portugal,native_ Puerto-Rico,native_ Scotland,native_ South,native_ Taiwan,native_ Thailand,native_ Trinadad&Tobago,native_ United-States,native_ Vietnam,native_ Yugoslavia
0,39,13,2174,0,40,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
1,50,13,0,0,13,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0

In [93]:
df3 = df2.drop(df2.columns[[5]], axis = 1)

In [94]:
df3.head(2)

,age,educationno,capitalgain,capitalloss,hoursperweek,workclass_ Federal-gov,workclass_ Local-gov,workclass_ Private,workclass_ Self-emp-inc,workclass_ Self-emp-not-inc,...,native_ Portugal,native_ Puerto-Rico,native_ Scotland,native_ South,native_ Taiwan,native_ Thailand,native_ Trinadad&Tobago,native_ United-States,native_ Vietnam,native_ Yugoslavia
0,39,13,2174,0,40,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
1,50,13,0,0,13,0,0,0,0,1,...,0,0,0,0,0,0,0,1,0,0

In [95]:
X = df3.iloc[:,:]

### Feature Engineering

In [96]:
from sklearn.tree import DecisionTreeClassifier

In [97]:
model=DecisionTreeClassifier()

In [98]:
model.fit(X,y)

DecisionTreeClassifier()

In [99]:
model.feature_importances_

array([1.62699122e-01, 1.15692657e-01, 1.26007508e-01, 4.52882893e-02,
       9.72110305e-02, 6.48208176e-03, 8.70699633e-03, 1.35117428e-02,
       7.41067594e-03, 1.06404785e-02, 6.43668546e-03, 0.00000000e+00,
       7.12121480e-05, 7.95023247e-04, 3.98753904e-04, 3.98206918e-05,
       2.18289492e-04, 6.50508306e-04, 4.07584766e-04, 2.97005900e-03,
       2.63699292e-03, 9.82950722e-04, 7.57165328e-04, 3.88576205e-03,
       2.14865074e-03, 2.06763396e-04, 1.27488769e-03, 5.35056710e-03,
       3.69260193e-03, 1.62495935e-04, 2.12440396e-01, 5.72498332e-04,
       3.35261536e-03, 1.24160996e-03, 1.07353649e-03, 6.84456849e-03,
       0.00000000e+00, 8.80959068e-03, 1.13632187e-02, 3.47282461e-03,
       3.75864909e-03, 5.16608884e-03, 6.36769331e-03, 4.96958185e-05,
       9.65840190e-03, 4.32254574e-03, 1.00004557e-02, 4.35218456e-03,
       5.78476114e-03, 3.63494498e-03, 4.00244441e-03, 1.78927426e-03,
       2.17996761e-03, 1.99814085e-03, 6.29525136e-03, 1.68201301e-03,
       2.36338559e-03, 5.58945359e-03, 1.00511785e-03, 7.11419095e-03,
       5.54369583e-03, 5.27992906e-03, 7.30569934e-04, 1.10847485e-03,
       5.26315860e-04, 3.45383551e-05, 9.03738089e-04, 1.04371147e-04,
       0.00000000e+00, 0.00000000e+00, 1.71890138e-03, 4.30328647e-04,
       1.26189594e-03, 3.46433766e-04, 1.89092365e-04, 5.70892602e-05,
       0.00000000e+00, 1.17521933e-04, 2.31617275e-04, 7.83707025e-04,
       4.48832715e-04, 4.43469280e-04, 1.11283760e-03, 6.62286032e-04,
       8.77342441e-04, 2.88342366e-04, 8.74218136e-04, 0.00000000e+00,
       0.00000000e+00, 5.65173084e-05, 1.34312943e-03, 8.13867127e-04,
       1.69284094e-04, 2.23314832e-04, 0.00000000e+00, 8.96987181e-04,
       2.35429515e-04, 2.09519520e-04, 1.89209229e-04, 7.96626475e-03,
       4.37598568e-04, 3.60453067e-04])

#### Dropping those columns whose feature importance is less.

In [100]:
X1 = df3.drop(df3.columns[[ 15, 25, 26, 36, 38, 65, 67, 74, 77, 84, 85, 89, 94, 96, 97]], axis = 1)

#### Splitting data into train and test

In [101]:
from sklearn.model_selection import train_test_split

In [102]:
x_train, x_test, y_train, y_test = train_test_split(X1, y, test_size = 0.33, random_state = 33)

### Fitting Model

In [103]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()
model.fit(x_train, y_train);

In [104]:
pred1 = model.predict(x_test)

In [105]:
from sklearn.metrics import confusion_matrix

In [107]:
### Test Accuracy
pred1 = model.predict(x_test)
cm = confusion_matrix(y_test, pred1)
print(cm)
print("Accuracy:", ((5167+1862)/(5167+1862+1408+441))*100)

[[5167 1408]
 [ 441 1862]]
Accuracy: 79.1732372155891

In [109]:
### Train Accuracy
pred2 = model.predict(x_train)
cm = confusion_matrix(y_train, pred2)
print(cm)
print("Accuracy:",((10690+3703)/(10690+3703+2758+874))*100)

[[10690  2758]
 [  874  3703]]
Accuracy: 79.8502080443828

### Conclusion : Our Model generalizes very well to the unseen data. Both train and test accuracies are nearly equal. Now we will create one more model and in that model we will pass whole dataset. After fitting this model we check accuracy for given test dataset.

In [110]:
###m Final Model for predicting on test dataset 
MODEL = GaussianNB()
MODEL.fit(X1, y);

## Test Dataset

In [111]:
DF = pd.read_csv("D:\\DATA_science\\DATA_science assignment\\Naive Bayes\\SalaryData_Test.csv")

In [112]:
DF.head()

,age,workclass,education,educationno,maritalstatus,occupation,relationship,race,sex,capitalgain,capitalloss,hoursperweek,native,Salary
0,25,Private,11th,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,<=50K
1,38,Private,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K
2,28,Local-gov,Assoc-acdm,12,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,40,United-States,>50K
3,44,Private,Some-college,10,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,7688,0,40,United-States,>50K
4,34,Private,10th,6,Never-married,Other-service,Not-in-family,White,Male,0,0,30,United-States,<=50K

In [114]:
DF.isnull().sum()

age              0
workclass        0
education        0
educationno      0
maritalstatus    0
occupation       0
relationship     0
race             0
sex              0
capitalgain      0
capitalloss      0
hoursperweek     0
native           0
Salary           0
dtype: int64

In [115]:
DF.describe()

                age   educationno   capitalgain   capitalloss  hoursperweek
count  15060.000000  15060.000000  15060.000000  15060.000000  15060.000000
mean      38.768327     10.112749   1120.301594     89.041899     40.951594
std       13.380676      2.558727   7703.181842    406.283245     12.062831
min       17.000000      1.000000      0.000000      0.000000      1.000000
25%       28.000000      9.000000      0.000000      0.000000     40.000000
50%       37.000000     10.000000      0.000000      0.000000     40.000000
75%       48.000000     13.000000      0.000000      0.000000     45.000000
max       90.000000     16.000000  99999.000000   3770.000000     99.000000

In [116]:
DF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15060 entries, 0 to 15059
Data columns (total 14 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   age            15060 non-null  int64
 1   workclass      15060 non-null  object
 2   education      15060 non-null  object
 3   educationno    15060 non-null  int64
 4   maritalstatus  15060 non-null  object
 5   occupation     15060 non-null  object
 6   relationship   15060 non-null  object
 7   race           15060 non-null  object
 8   sex            15060 non-null  object
 9   capitalgain    15060 non-null  int64
 10  capitalloss    15060 non-null  int64
 11  hoursperweek   15060 non-null  int64
 12  native         15060 non-null  object
 13  Salary         15060 non-null  object
dtypes: int64(5), object(9)
memory usage: 1.6+ MB

#### Dropping duplicates

In [118]:
DF1 = DF.drop_duplicates()

In [120]:
DF1.shape

(14130, 14)

### Label Encoder

In [123]:
from sklearn.preprocessing import LabelEncoder
labelencoder = LabelEncoder()
DF1.iloc[:, -1] = labelencoder.fit_transform(DF1.iloc[:,-1])
#DF1.head(3)

C:\Users\LENOVO\anaconda3\lib\site-packages\pandas\core\indexing.py:1745: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  isetter(ilocs[0], value)

In [124]:
Y = DF1['Salary']

In [125]:
DF2 = pd.get_dummies(DF1)

In [127]:
DF2.head(2)

,age,educationno,capitalgain,capitalloss,hoursperweek,Salary,workclass_ Federal-gov,workclass_ Local-gov,workclass_ Private,workclass_ Self-emp-inc,...,native_ Portugal,native_ Puerto-Rico,native_ Scotland,native_ South,native_ Taiwan,native_ Thailand,native_ Trinadad&Tobago,native_ United-States,native_ Vietnam,native_ Yugoslavia
0,25,7,0,0,40,0,0,0,1,0,...,0,0,0,0,0,0,0,1,0,0
1,38,9,0,0,50,0,0,0,1,0,...,0,0,0,0,0,0,0,1,0,0

In [128]:
DF3 = DF2.drop(DF2.columns[[5]], axis = 1)

In [129]:
X = DF3.iloc[:,:]

In [131]:
X = DF3.drop(DF3.columns[[ 15, 25, 26, 36, 38, 65, 67, 74, 77, 84, 85, 89, 94, 96, 97]], axis = 1)

#### Train Accuracy

In [136]:
### Train Accuracy
pred4 = MODEL.predict(X1)
cm = confusion_matrix(y, pred4)
print(cm)
print("Accuracy:", ((15820+5592)/(15820+5592+4203+1288))*100)

[[15820  4203]
 [ 1288  5592]]
Accuracy: 79.58963684347471

#### Test Accuracy

In [134]:
### Test Accuracy
pred3 = MODEL.predict(X)
cm = confusion_matrix(Y, pred3)
print(cm)
print("Accuracy:", ((8341+2874)/(8341+2874+2279+636))*100)

[[8341 2279]
 [ 636 2874]]
Accuracy: 79.37013446567587

### Conclusion : Our Model generalizes very well to the unseen data. Both train and test accuracies are nearly equal. That is our model classifies unseen data very well.